# IsProductListEntryCompatibleSize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..IsProductListEntryCompatibleSize Method
FabricationPart Class See Also
---
Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Release
# Syntax
C#
---
```text
public bool IsProductListEntryCompatibleSize(
	int productEntry
)
```

Visual Basic
---
```text
Public Function IsProductListEntryCompatibleSize ( _
	productEntry As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsProductListEntryCompatibleSize(
	int productEntry
)
```

# ### Parameters
productEntry
    Type: System..::..Int32 The product entry index.
# ### Return Value
Returns true if the part can be changed to the specified product entry without altering any connected dimensions.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The product entry index is not larger than 0 and less than GetProductCount. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace